nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]          # 2-P2

  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, DSFCM, [256, 8]] # 5

  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 6, C2f, [512, True]]          # 7
  - [-1, 1, DSFCM, [512, 16]]# 8

  - [-1, 1, MKCPB, [512]]             # 9
  - [-1, 1, SPPF, [512, 5]]            # 10
  - [-1, 1, DSFCM, [512, 32]]# 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 5], 1, Concat, [1]]          # 13
  - [-1, 3, C2f, [256]]                # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 2], 1, Concat, [1]]          # 16
  - [-1, 3, C2f, [128]]                # 17 (P2/4)

  - [-1, 1, Conv, [128, 3, 2]]         # 18
  - [[-1, 14], 1, Concat, [1]]         # 19
  - [-1, 3, C2f, [256]]                # 20

  - [-1, 1, Conv, [256, 3, 2]]         # 21
  - [[-1, 9], 1, Concat, [1]]          # 22
  - [-1, 3, C2f, [512]]                # 23

  - [[2,17,20, 23], 1, Detect, [nc]]     # 24